# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------
brew "git"
brew "zsh"
brew "starship"
brew "coreutils"
brew "direnv"
brew "wget"
brew "tree"
brew "eza"
brew "zoxide"
brew "fzf"
brew "pygments"
brew "jq"
brew "yq"
brew "kubectx"

# ------------------------------------------------------------------------------
# Cask
# ------------------------------------------------------------------------------
cask "gpg-suite"
cask "ghostty"
cask "zed"
cask "bruno"
cask "fork"

# k8s
cask "freelens"
