# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------
brew "git"
brew "zsh"
brew "zsh-completions"
brew "starship"
brew "coreutils"
brew "direnv"
brew "wget"
brew "tree"
brew "eza"
brew "zoxide"
brew "fzf"
brew "pygments"

# ------------------------------------------------------------------------------
# Cask
# ------------------------------------------------------------------------------
cask "gpg-suite"

cask "ghostty"
cask "zed"

# k8s
cask "freelens"

# Quick Look plugins
cask "qlcolorcode" # https://github.com/anthonygelibert/QLColorCode
cask "qlstephen" # https://github.com/whomwah/qlstephen
cask "quicklook-json" # https://github.com/sindresorhus/quick-look-plugins
cask "webpquicklook" # https://github.com/dchest/webp-quicklook
